Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresInfo.GetCommonAppDataFolder Method
 Returns (XSDATADIR)environments installation folder of the Tekla Structures as string.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetCommonAppDataFolder()
Public Shared Function GetCommonAppDataFolder As String
Return Value
Type: String
The (XSDATADIR)environments installation folder of the Tekla Structures.
See Also
Reference
TeklaStructuresInfo Class
Tekla.Structures Namespace